emacs/.emacs.gnu/emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
* Be Literate
This file will generate [[file:init.el][init.el]] which can be loaded by Emacs on startup.

** Inspirations
Maybe some things look familiar?
These sources helped me a lot building my own emacs configuration - well that sounds like it's a finished task, but we all know that this will be tinkered upon forever.
- [[https://www.youtube.com/c/SystemCrafters][Systemcrafters]] youtube channel

* Resets
#+begin_src emacs-lisp
  ;; -*- lexical-binding: t -*-
  (setq inhibit-startup-message t) ; disable startup message

  (scroll-bar-mode -1) ; Disable visible scrollbar
  (tool-bar-mode -1)  ; Disable the toolbar
  (tooltip-mode -1) ; Disable tooltips
  (set-fringe-mode 15) ; Some breathing room
  (menu-bar-mode -1) ; Disable menu bar

  (setq visible-bell nil)
  (setq ring-bell-function 'ignore) ; no thank you
#+end_src

** clipboard
#+begin_src emacs-lisp
  (setq x-select-enable-clipboard t)
  (setq x-select-enable-primary t)
#+end_src

** autosaves
Not a fan of the backup~ and #autosave# files, I usually just find them cluttering up everything.
#+begin_src emacs-lisp
  (setq make-backup-files nil) ; stop creating backup~ files
  (setq auto-save-default nil) ; stop creating #autosave# files
#+end_src

* Package Management
** package sources
You can always run package-refresh-contents in case that a package was not found.
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src

** initialize use-package
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

* Keybindings
** which-key
Make keybindings discoverable.
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))
#+end_src

** general
Easy setup of keybindings.
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-create-definer oem/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (oem/leader-key-def
      "SPC" '(mode-line-other-buffer :which-key "toggle between recent buffers")
      "x" '(counsel-M-x :which-key "M-x")
      "b" '(:ignore t :which-key "buffer")
      "bb" '(switch-to-buffer :which-key "switch buffer")
      "bp" '(previous-buffer :which-key "previous buffer")))
#+end_src

** evil
Can't live without vim keybindings.
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :ensure t
    :config
    (evil-collection-init))
#+end_src

** key-chord
#+begin_src emacs-lisp
  (use-package key-chord
    :init
    (setq key-chord-two-keys-delay 0.3)
    (key-chord-define evil-insert-state-map "fd" 'evil-normal-state)
    :config
    (key-chord-mode 1))
#+end_src

** hydra
For cycling things.
I also snug in some keybindings to change to a larger font quickly. I personally prefer my beloved Tamsyn font, but not everyone can read it easily when pairing.
#+begin_src emacs-lisp
            (use-package hydra)
            (defhydra hydra-text-scale (:timeout 4)
              "scale text"
              ("j" text-scale-increase "in")
              ("k" text-scale-decrease "out")
              ("f" nil "finished" :exit t))

            (oem/leader-key-def
              "t" '(:ignore t :which-key "text")
              "tt" '(load-theme :which-key "load theme")
              "ts" '(hydra-text-scale/body :which-key "text scale")
              "tf" '(:ignore t :which-key "fonts")
              "tfF" '(lambda () (interactive)
                       (set-face-attribute 'default nil :family "PragmataPro Mono" :height 140 :weight 'bold)
                       (set-face attribute 'fixed-pitch nil :font "PragmataPro Mono" :height 140 :weight 'bold))
              "tff" '(lambda () (interactive)
                       (set-face-attribute 'default nil :family "Tamsyn" :height 100 :weight 'normal)
                       (set-face-attribute 'fixed-pitch nil :family "Tamsyn" :height 100 :weight 'normal)))
#+end_src

* Finding things
** swiper and ivy
#+begin_src emacs-lisp
  (use-package swiper
    :ensure t)

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package ivy-rich)
#+end_src

** finding files
#+begin_src emacs-lisp
  (oem/leader-key-def
    "f" '(:ignore t :which-key "file")
    "ff" '(find-file :which-key "find file")
    "fr" '(counsel-buffer-or-recentf :which-key "recent files")
    "fc" '(lambda () (interactive) (find-file (expand-file-name "~/.dotfiles/emacs/.emacs.d/emacs.org"))))
#+end_src

** finding projects
*** projectile
#+begin_src emacs-lisp
    (use-package projectile
      :diminish projectile-mode
      :config (projectile-mode)
      :custom ((projectile-completion-system 'ivy))
      :bind-keymap
      ("C-c p" . projectile-command-map)
      :init
      (when (file-directory-p "~/src")
        (setq projectile-project-search-path '("~/src")))
      (setq projectile-switch-project-action #'projectile-dired))

    (use-package counsel-projectile
      :config (counsel-projectile-mode))

    (oem/leader-key-def
      "p" '(:ignore t :which-key "projects")
      "pf" '(projectile-find-file :which-text "find file in project")
      "pp" '(projectile-switch-project :which-text "switch projects"))
#+end_src

** finding processes
#+begin_src emacs-lisp
  (oem/leader-key-def
    "ps" '(proced :which-key "processes"))
#+end_src

* Completing things
** counsel
#+begin_src emacs-lisp
  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)))
#+end_src

** company mode
#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (progr-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src

* Selecting things
** expand-region
#+begin_src emacs-lisp
  (use-package expand-region
    :bind
    ("C-=" . er/expand-region)
    ("C--" . er/contract-region))
#+end_src

* git
** magit
#+begin_src emacs-lisp
  (use-package magit)
#+end_src

#+begin_src emacs-lisp
  (oem/leader-key-def
    "g" '(:ignore t :which-key "version control")
    "gg" '(magit-status :which-key "status"))
#+end_src

* Help
#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-callable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

* Errors
#+begin_src emacs-lisp
  (use-package flycheck
    :init
    (global-flycheck-mode t))
#+end_src

* Development
** languages
*** rust
#+begin_src emacs-lisp
  (defun oem/rustic-mode-hook ()
    (when buffer-file-name
      (setq-local buffer-save-without-query t)))

  (use-package rustic
    :config
    (setq rustic-lsp-client 'lsp-mode
          rustic-lsp-server 'rust-analyzer
          rustic-analuzer-command '("/usr/local/bin/rust-analyzer"))
    (setq rustic-format-on-save t)
    (setq rust-format-on-save t)
    (add-hook 'rustic-mode-hook 'oem/rustic-mode-hook))
#+end_src

*** python
*** ruby
*** javascript

