emacs/.emacs.d/init.el

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :custom
  (lsp-rust-analyzer-server-display-inlay-hints t)
  :config
  (add-hook 'lsp-mode-hook 'lsp-ui-mode)
  (setq lsp-headerline-breadcrumb-enable nil)
  :hook (
         (rust-mode . lsp-deferred)
         (ruby-mode . lsp-deferred)
         (lsp-mode . lsp-enable-which-key-integration)))

(use-package lsp-ui
  :commands lsp-ui-mode
  :custom
  (lsp-ui-peek-always-show t)
  (lsp-ui-sideline-show-hover nil)
  (lsp-ui-doc-enable nil))

(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

(use-package evil-nerd-commenter)

(oem/leader-key-def
  "/" '(evilnc-comment-or-uncomment-lines :which-key "comment"))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom (doom-modeline-height 35))

(use-package doom-themes
  :init (load-theme 'doom-plain-dark t))

(use-package all-the-icons)

(pcase system-type
  ((or 'gnu/linux 'windows-nt 'cygwin)
   (set-face-attribute 'default nil :family "Tamsyn" :height 100 :weight 'normal))
  ('darwin
   (set-face-attribute 'default nil :font "PragmataPro Mono" :height 140 :weight 'bold)

   ;; for mac os: transparent titlebar without icons
   (add-to-list 'default-frame-alist  '(ns-transparent-titlebar . t))
   (setq ns-use-proxy-icon nil)
   (setq frame-title-format nil)))

(setq-default line-spacing 10)

(set-face-attribute 'fixed-pitch nil :family "Tamsyn" :weight 'normal)
(set-face-attribute 'variable-pitch nil :font "Avenir Next LT Pro" :weight 'regular)

(set-face-attribute 'org-block-begin-line nil :family "Tamsyn" :weight 'normal)
(set-face-attribute 'org-block-end-line nil :family "Tamsyn" :weight 'normal)
(set-face-attribute 'org-block nil :family "Tamsyn" :weight 'normal)

(toggle-frame-maximized)

(defun oem/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
  :hook (org-mode . oem/org-mode-setup)
  :config
  (setq org-ellipsis " ✜")

  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
          (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

  (setq org-tag-alist
        '((:startgroup)
          ; put mutually exclusive tags here
          (:endgroup)
          ("@errand" . ?E)
          ("agenda" . ?a)
          ("planning" . ?p)
          ("idea" . ?i)))

  (load-library "find-lisp")
  (setq org-agenda-start-with-log-mode t)
  (setq org-agenda-window-setup 'current-window)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  ;; org habit
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

  ;; save org buffers after refiling
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  ;; custom org agenda views
  (setq org-agenda-custom-commands
        '(("d" "Dashboard"
           ((agenda "" ((org-deadline-warning-days 7)))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Next Tasks")))
            (todo "ACTIVE"
                  ((org-agenda-overriding-header "Active Tasks")))))

          ("n" "Next Tasks"
           ((todo "NEXT"
                  ((org-agenda-overriding-header "Next Tasks")))))

          ("W" "Work Tasks" tags-todo "+work")

          ("w" "Workflow Status"
           ((todo "WAIT"
                  ((org-agenda-overriding-header "Waiting on External")))
            (todo "PLAN"
                  ((org-agenda-overriding-header "In Planning")))
            (todo "BACKLOG"
                  ((org-agenda-overriding-header "Backlog")))
            (todo "READY"
                  ((org-agenda-overriding-header "Ready")))
            (todo "ACTIVE"
                  ((org-agenda-overriding-header "Active")))
            (todo "REVIEW"
                  ((org-agenda-overriding-header "In Review")))
            (todo "COMPLETED"
                  ((org-agenda-overriding-header "Completed")))
            (todo "CANC"
                  ((org-agenda-overriding-header "Cancelled")))
            )))))

(oem/leader-key-def
  "o" '(:ignore t :which-key "org")
  "oa" '(org-agenda :which-key "org-agenda"))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◎" "◉" "○" "●")))

(require 'org-indent)

(dolist (face '((org-level-1 . 2.8)
                (org-level-2 . 2.2)
                (org-level-3 . 1.8)
                (org-level-4 . 1.4)
                (org-level-5 . 1.2)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)
                (org-document-title . 1.3)))
  (set-face-attribute (car face) nil :font "Avenir Next LT Pro" :weight 'bold :height (cdr face)))

;; we don't want variable fonts for everything in org mode:
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil :inherit 'fixed-pitch)
(set-face-attribute 'org-drawer nil :inherit 'fixed-pitch)
(set-face-attribute 'org-document-title nil :foreground nil :inherit 'variable-pitch)
(set-face-attribute 'org-document-info-keyword nil :weight 'bold :inherit 'fixed-pitch)
(set-face-attribute 'org-property-value nil :inherit 'fixed-pitch)
(set-face-attribute 'org-date nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

(defun oem/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . oem/org-mode-visual-fill))

(setq org-confirm-babel-evaluate nil)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (shell . t)
   (python . t)))
