emacs/.emacs.gnu/emacs.org
** structure templates
#+begin_src emacs-lisp
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
#+end_src

** Setting up the config
Apply the same configuration to every block:
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

** Auto-tangle config file
We want to tangle this file whenever we save changes.
#+begin_src emacs-lisp
  (defun oem/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.dotfiles/emacs/.emacs.d/emacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook
            (lambda () (add-hook 'after-save-hook #'oem/org-babel-tangle-config)))
#+end_src

* Org Roam
This is an effort to replicate the Zettelkasten System. Org Roam itself tries to implement features of the Roam software in Org Mode.
** Setting things up
#+begin_src emacs-lisp
  (use-package org-roam
    :demand t
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/sync/notes")
    (org-roam-completion-everywhere t)
    :bind (
           :map org-mode-map
           ("C-M-i" . completion-at-point))
    :config
    (require 'org-roam-dailies)
    (org-roam-db-autosync-mode))
#+end_src

** Agenda
*** Finding things
*Filter by tag*
The buffer you put this in must have lexical-binding set to t!
#+begin_src emacs-lisp
  (defun oem/org-roam-filter-by-tag (tag-name)
    (lambda (node)
      (member tag-name (org-roam-node-tags node))))
#+end_src

*List notes by tag*
#+begin_src emacs-lisp
  (defun oem/org-roam-list-notes-by-tag (tag-name)
    (mapcar #'org-roam-node-file
            (seq-filter
             (oem/org-roam-filter-by-tag tag-name)
             (org-roam-node-list))))

  (defun oem/org-roam-refresh-agenda-list ()
    (interactive)
    (setq org-agenda-files (oem/org-roam-list-notes-by-tag "Project")))

  (oem/org-roam-refresh-agenda-list)
#+end_src

*Find or create project*
#+begin_src emacs-lisp
  (defun oem/org-roam-project-finalize-hook ()
    "Adds the captured project file to `org-agenda-files' if the
  capture was not aborted."
    ;; Remove the hook since it was added temporarily
    (remove-hook 'org-capture-after-finalize-hook #'oem/org-roam-project-finalize-hook)

    ;; Add project file to the agenda list if the capture was confirmed
    (unless org-note-abort
      (with-current-buffer (org-capture-get :buffer)
        (add-to-list 'org-agenda-files (buffer-file-name)))))

  (defun oem/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'oem/org-roam-project-finalize-hook)

    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
     nil
     nil
     (oem/org-roam-filter-by-tag "Project")
     :templates
     '(("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
        :unnarrowed t))))

(global-set-key (kbd "C-c n p") #'oem/org-roam-find-project)
#+end_src

** Capture
We would like to capture notes and tasks quickly to an inbox with org-roam. We are currently using org-capture for this, but let's not use two competing organization systems that have a harder time talking to each other.
We also want to capture tasks directly into project files.

*** Capture into the inbox for later processing
#+begin_src emacs-lisp
  (defun oem/org-roam-capture-inbox()
    (interactive)
    (org-roam-capture- :node (org-roam-node-create)
                       :templates '(("i" "inbox" plain "* %?\n %U\n %a\n %i"
                                     :if-new (file+head "inbox.org" "#+title: Inbox\n")))))
#+end_src

*** Capture personal metrics
#+begin_src emacs-lisp
  (defun oem/org-roam-capture-metrics()
    (interactive)
    (org-roam-capture- :node (org-roam-node-create)
                       :templates '(("w" "Water" table-line "| %U | %^{Glasses} |"
                                     :if-new (file+head+olp "metrics.org"
                                                            "#+title: Personal metrics\n"
                                                            ("Water")))
                                    ("W" "Weight" table-line "| %U | %^{kg} | %^{notes} |"
                                     :if-new (file+head+olp "metrics.org"
                                                            "#+title: Personal metrics\n"
                                                            ("Weight"))))))
#+end_src

*** Capture into projects
#+begin_src emacs-lisp
  (defun oem/org-roam-capture-task()
    (interactive)
    ;; add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'oem/org-roam-project-finalize-hook)

    ;; capture the new task, creating the project file if necessary
    (org-roam-capture-
     :node (org-roam-node-read
            nil
            (oem/org-roam-filter-by-tag "Project"))
     :templates '(("p" "project" plain "** TODO %?"
                   :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                          "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                          ("Tasks"))))))
#+end_src

** Refiling things
#+begin_src emacs-lisp
  (defun oem/org-refile-to (file headline)
    "Move current headline to specific location"
    (interactive)
    (let ((org-after-refile-insert-hook #'save-buffer)
          (pos (save-window-excursion
                 (find-file file)
                 (org-find-exact-headline-in-buffer headline))))
      (org-refile nil nil (list headline file nil pos))))
#+end_src

*** on completion
Not actually refiling, we are copying the item to the current daily file.
#+begin_src emacs-lisp
  (defun oem/org-roam-copy-to-today (keep)
    (interactive)
    (let ((org-refile-keep keep) ;; Set this to nil to delete the original!
          (org-roam-dailies-capture-templates
           '(("t" "tasks" entry "%?"
              :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
          (org-after-refile-insert-hook #'save-buffer)
          today-file
          pos)
      (save-window-excursion
        (org-roam-dailies--capture (current-time) t)
        (setq today-file (buffer-file-name))
        (setq pos (point)))

      ;; Only refile if the target file is different than the current file
      (unless (equal (file-truename today-file)
                     (file-truename (buffer-file-name)))
        (org-refile nil nil (list "Tasks" today-file nil pos)))))

  (add-to-list 'org-after-todo-state-change-hook
               (lambda ()
                 (unless (equal buffer-file-name "/home/oem/sync/notes/habits.org")
                   (if (and (equal org-state "DONE") (equal buffer-file-name "/home/oem/sync/notes/todos.org"))
                       (oem/org-roam-copy-to-today nil)
                     (if (equal org-state "DONE")
                         (oem/org-roam-copy-to-today t))))))
#+end_src

*** on setting to TODO
When we are going through our inbox we want to process the items.
The simple case, where we want to turn an item into an actionable item, should be as automated as possible. In the best case we mark an item with *TODO* and it is being moved to =todos.org=.
#+begin_src emacs-lisp
  (add-to-list 'org-after-todo-state-change-hook
               (lambda ()
                 (when (and (equal org-state "TODO") (or (equal buffer-file-name "/home/oem/sync/notes/inbox.org") (equal buffer-file-name "/home/oem/sync/notes/maybe.org")))
                   (oem/org-refile-to "~/sync/notes/todos.org" ""))))
#+end_src     

*** on setting to MAYBE
#+begin_src emacs-lisp
  (add-to-list 'org-after-todo-state-change-hook
               (lambda ()
                 (when (equal org-state "MAYBE")
                   (oem/org-refile-to "~/sync/notes/maybe.org" ""))))
#+end_src

