emacs/.emacs.d/init.el

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))

(defun oem/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.dotfiles/emacs/.emacs.d/emacs.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'oem/org-babel-tangle-config)))

(use-package org-roam
  :demand t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/sync/notes")
  (org-roam-completion-everywhere t)
  :bind (
         :map org-mode-map
         ("C-M-i" . completion-at-point))
  :config
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode))

(defun oem/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun oem/org-roam-list-notes-by-tag (tag-name)
  (mapcar #'org-roam-node-file
          (seq-filter
           (oem/org-roam-filter-by-tag tag-name)
           (org-roam-node-list))))

(defun oem/org-roam-refresh-agenda-list ()
  (interactive)
  (setq org-agenda-files (oem/org-roam-list-notes-by-tag "Project")))

(oem/org-roam-refresh-agenda-list)

(defun oem/org-roam-project-finalize-hook ()
    "Adds the captured project file to `org-agenda-files' if the
  capture was not aborted."
    ;; Remove the hook since it was added temporarily
    (remove-hook 'org-capture-after-finalize-hook #'oem/org-roam-project-finalize-hook)

    ;; Add project file to the agenda list if the capture was confirmed
    (unless org-note-abort
      (with-current-buffer (org-capture-get :buffer)
        (add-to-list 'org-agenda-files (buffer-file-name)))))

  (defun oem/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'oem/org-roam-project-finalize-hook)

    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
     nil
     nil
     (oem/org-roam-filter-by-tag "Project")
     :templates
     '(("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
        :unnarrowed t))))

(global-set-key (kbd "C-c n p") #'oem/org-roam-find-project)

(defun oem/org-roam-capture-inbox()
  (interactive)
  (org-roam-capture- :node (org-roam-node-create)
                     :templates '(("i" "inbox" plain "* %?\n %U\n %a\n %i"
                                   :if-new (file+head "inbox.org" "#+title: Inbox\n")))))

(defun oem/org-roam-capture-metrics()
  (interactive)
  (org-roam-capture- :node (org-roam-node-create)
                     :templates '(("w" "Water" table-line "| %U | %^{Glasses} |"
                                   :if-new (file+head+olp "metrics.org"
                                                          "#+title: Personal metrics\n"
                                                          ("Water")))
                                  ("W" "Weight" table-line "| %U | %^{kg} | %^{notes} |"
                                   :if-new (file+head+olp "metrics.org"
                                                          "#+title: Personal metrics\n"
                                                          ("Weight"))))))

(defun oem/org-roam-capture-task()
  (interactive)
  ;; add the project file to the agenda after capture is finished
  (add-hook 'org-capture-after-finalize-hook #'oem/org-roam-project-finalize-hook)

  ;; capture the new task, creating the project file if necessary
  (org-roam-capture-
   :node (org-roam-node-read
          nil
          (oem/org-roam-filter-by-tag "Project"))
   :templates '(("p" "project" plain "** TODO %?"
                 :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                        "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                        ("Tasks"))))))

(defun oem/org-roam-copy-to-today (keep)
  (interactive)
  (let ((org-refile-keep keep) ;; Set this to nil to delete the original!
        (org-roam-dailies-capture-templates
         '(("t" "tasks" entry "%?"
            :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
        (org-after-refile-insert-hook #'save-buffer)
        today-file
        pos)
    (save-window-excursion
      (org-roam-dailies--capture (current-time) t)
      (setq today-file (buffer-file-name))
      (setq pos (point)))

    ;; Only refile if the target file is different than the current file
    (unless (equal (file-truename today-file)
                   (file-truename (buffer-file-name)))
      (org-refile nil nil (list "Tasks" today-file nil pos)))))

(add-to-list 'org-after-todo-state-change-hook
             (lambda ()
               (if (and (equal org-state "DONE") (equal buffer-file-name "/home/oem/sync/notes/todos.org"))
                 (oem/org-roam-copy-to-today nil)
                 (if (equal org-state "DONE")
                 (oem/org-roam-copy-to-today t)))))

(defun oem/org-refile-to (file headline)
  "Move current headline to specific location"
  (interactive)
  (let ((org-after-refile-insert-hook #'save-buffer)
        (pos (save-window-excursion
               (find-file file)
               (org-find-exact-headline-in-buffer headline))))
    (org-refile nil nil (list headline file nil pos))))

(add-to-list 'org-after-todo-state-change-hook
             (lambda ()
               (when (and (equal org-state "TODO") (equal buffer-file-name "/home/oem/sync/notes/inbox.org"))
                 (oem/org-refile-to "~/sync/notes/todos.org" "Tasks"))))

(oem/leader-key-def
