emacs/.emacs.gnu/emacs.org
** Keybindings
They are for now all prefixed with =leader oo= to not clash with the normal org mode keybindings (which are prefixed with just =leader o=). But once I have replicated the previous functionality I might simplify that prefix to be =leader o=.
#+begin_src emacs-lisp
  (oem/leader-key-def
    "ob" '(org-roam-buffer-toggle :which-text "org roam buffer toggle")
    "od" '(:ignore t :which-key "org roam dailies")
    "odn" '(org-roam-dailies-goto-next-note :which-key "org roam dailies -> next")
    "odp" '(org-roam-dailies-goto-previous-note :which-key "org roam dailies -> previous")
    "odd" '(org-roam-dailies-goto-today :which-key "org roam dailies -> today")
    "ody" '(org-roam-dailies-capture-yesterday :which-key "org roam dailies yesterday")
    "odt" '(org-roam-dailies-capture-tomorrow :which-key "org roam dailies tomorrow")
    "oc" '(:ignore t :which-key "org roam capture")
    "oci" '(oem/org-roam-capture-inbox :which-key "org roam capture into inbox")
    "ocm" '(oem/org-roam-capture-metrics :which-key "org roam capture metrics")
    "ocp" '(oem/org-roam-capture-task :which-key "org roam capture into project")
    "op" '(oem/org-roam-find-project :which-key "find or create project")
    "oo" '(org-roam-node-find :which-key "org roam node find")
    "oi" '(org-roam-node-insert :which-key "org roam node insert"))
#+end_src

* Encryption
** pinentry
#+begin_src emacs-lisp
  (use-package pinentry)
#+end_src

#+begin_src shell :tangle ~/.gnupg/gpg-agent.conf :results output silent
  pinentry-program /usr/bin/pinentry-emacs
  default-cache-ttl 3600
  allow-emacs-pinentry
#+end_src

#+begin_src shell :results output silent
  cat ~/.gnupg/gpg-agent.conf
#+end_src

#+begin_src emacs-lisp
  (require 'epg)
  (setq epg-pinentry-mode 'loopback)
#+end_src

#+begin_src emacs-lisp
  (pinentry-start)
#+end_src

** using pass from emacs
#+begin_src emacs-lisp
  (use-package pass
    :pin melpa
    :config
    (setf epg-pinentry-mode 'loopback))
#+end_src

* Mail
** dependencies
We need to install a few dependencies outside of Emacs:
#+begin_src bash
aura -A mu mbsync-git
#+end_src
*** mbsync
**** Setting up a configuration
We need a configuration file in our home folder: =~/.mbsyncrc=.
Gmail accounts without 2fa need to allow "[[https://support.google.com/accounts/answer/6010255?p=lsa_blocked&hl=en-GB&visit_id=637668782853662647-1246343737&rd=1#zippy=%2Cif-less-secure-app-access-is-on-for-your-account][less secure apps]]".
Sync emails: ~mbsync -a~.
Gmail with 2fa need an app password.

*** mu
mu is a mail indexer.
Index your emails:
#+begin_src bash
  mu init --maildir=<mail folder> --my-address=<email address>
  mu index
#+end_src

For multiple accounts you just need to provide them all in ~mu init~:
#+begin_src shell
  mu init --maildir=<mail folder> --my-address=<first address> --my-address=<second address>
  mu index
#+end_src
This assumes that the emails are all in (sub) folders of the maildir. Otherwise you will also need to provide multiple ~--maildir~.

** managing mail with mu4e
mu4e is the Emacs interface to the mu mail indexer.
It syncs your emails in the background using an external program.
#+begin_src emacs-lisp
  (load "~/sync/mail-config/accounts.el")
#+end_src

** attachments
#+begin_src emacs-lisp
  (setq mu4e-attachment-dir "~/Downloads"
        mu4e-view-show-images t
        mu4e-use-fancy-chars t)
#+end_src

** view emails
#+begin_src emacs-lisp
  (setq mu4e-view-show-images t
        mu4e-show-images t
        mu4e-view-image-max-width 800)
#+end_src

** sending emails
We use the build-in functionality from Emacs to send mails.
#+begin_src emacs-lisp
  (setq message-send-mail-function 'smtpmail-send-it)
  (setq mu4e-sent-messages-behavior 'delete)
#+end_src

#+begin_src emacs-lisp
(require 'smtpmail)
#+end_src

Getting the smtp passwords from pass
#+begin_src emacs-lisp
  (auth-source-pass-enable)
  (setq auth-source-debug t)
  (setq auth-source-do-cache nil)
  (setq message-kill-buffer-on-exit t)
  (setq smtpmail-debug-info t)
  (setq smtpmail-stream-type 'ssl)
#+end_src
