emacs/.emacs.d/init.el
  "ob" '(org-roam-buffer-toggle :which-text "org roam buffer toggle")
  "od" '(:ignore t :which-key "org roam dailies")
  "odn" '(org-roam-dailies-goto-next-note :which-key "org roam dailies -> next")
  "odp" '(org-roam-dailies-goto-previous-note :which-key "org roam dailies -> previous")
  "odd" '(org-roam-dailies-goto-today :which-key "org roam dailies -> today")
  "ody" '(org-roam-dailies-capture-yesterday :which-key "org roam dailies yesterday")
  "odt" '(org-roam-dailies-capture-tomorrow :which-key "org roam dailies tomorrow")
  "oc" '(:ignore t :which-key "org roam capture")
  "oci" '(oem/org-roam-capture-inbox :which-key "org roam capture into inbox")
  "ocm" '(oem/org-roam-capture-metrics :which-key "org roam capture metrics")
  "ocp" '(oem/org-roam-capture-task :which-key "org roam capture into project")
  "op" '(oem/org-roam-find-project :which-key "find or create project")
  "oo" '(org-roam-node-find :which-key "org roam node find")
  "oi" '(org-roam-node-insert :which-key "org roam node insert"))

(use-package pinentry)

(require 'epg)
(setq epg-pinentry-mode 'loopback)

(pinentry-start)

(load "~/sync/mail-config/accounts.el")

(setq mu4e-attachment-dir "~/Downloads"
      mu4e-view-show-images t
      mu4e-use-fancy-chars t)
